snlkuharlocal/src/Documents/ПутевойЛист/ПутевойЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПутевойЛист</name>
  <basedOn>Document.ПутевойЛист</basedOn>
  <registerRecords>InformationRegister.ПоказанияСпидометра</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиГСМ</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>КонечныйСпидометр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОстатокТопливаВозврат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Рейсов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Механик</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Диспетчер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Медик</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказчикПредставитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик1Представитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыездИзГаража</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозвращениеВГараж</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп1</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПутевого</name>
    <type>
      <types>EnumRef.ТипПутевогоЛиста</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРаботы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРаботы1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик1</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик2</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик3</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик4</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПрибытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПрибытия1</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПрибытия2</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПрибытия3</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПрибытия4</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПробегЗаПутевку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОстатокТопливаВыезд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальныйСпидометр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаправкаНаМаршруте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпидометрСкорректированВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыездИзГаражаФактический</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозвращениеВГаражФактическое</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДеньВыездаФакт</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДеньВозвращениеФакт</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоВтораяХодка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаданиеВодителю</name>
    <attributes>
      <name>Заказчик</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяПрибытия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресПунктаПогрузки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресПунктаРазгрузки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Груз</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЕздок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расстояние</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПеревезтиТонн</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаданиеВодителюАвтобусНеОбщегоПользования</name>
    <attributes>
      <name>Откуда</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Куда</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расстояние</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/AccumulationRegisters/ОстаткиГСМ/ОстаткиГСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиГСМ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/InformationRegisters/НормыРасходаГСМ/НормыРасходаГСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыРасходаГСМ</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Линейная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаОперацию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МодельТС</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГСМ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/ТипПутевогоЛиста/ТипПутевогоЛиста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипПутевогоЛиста</name>
  <enumValues>
    <name>ЛегковойАвтомобиль</name>
  </enumValues>
  <enumValues>
    <name>ГрузовойАвтомобильФорма4_С</name>
  </enumValues>
  <enumValues>
    <name>ГрузовойАвтомобильФорма4_П</name>
  </enumValues>
  <enumValues>
    <name>АвтобусНеОбщегоПользования</name>
  </enumValues>
  <enumValues>
    <name>СпециальныйАвтомобиль</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Catalogs/Автомобили/Автомобили.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Автомобили</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ГосНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Марка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДняРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказнаяАМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АНТОР_УровеньДоступа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоТочек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйПробегЗаДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДоставкиАвтомобиля</name>
    <type>
      <types>EnumRef.ТипДоставкиАвтомобиля</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияАвтомобиля</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПаллет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Грузоподъемность</name>
    <comment>Грузоподъемность, т</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипВладения</name>
    <type>
      <types>EnumRef.ТипСобственностиТС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

snlkuharlocal/src/Documents/ПутевойЛист/ManagerModule.bsl
//////СПЕЦИАЛЬНЫЙ АВТОМОБИЛЬ///////////////
Процедура Печать_СА_Лицевая(ТабДок, Ссылка) Экспорт
	
	ТабДок.ОриентацияСтраницы   = ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб          = Истина;
	ТабДок.ОтображатьСетку      = Ложь;
	ТабДок.ПолеСверху           = 20;
	ТабДок.ПолеСнизу            = 10;
	ТабДок.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ";
	Макет                       = ПолучитьОбщийМакет("СпецАвтомобиль");     	
	
	ЛицеваяСторона                                          = Макет.ПолучитьОбласть("Лицо");	
	ЛицеваяСторона.Параметры.Номер                          = Ссылка.Номер;
	ЛицеваяСторона.Параметры.Дата                           = Формат(Ссылка.Дата,"ДЛФ=DD");
	Реквизиты = Ссылка.Организация.Наименование + " " + Ссылка.Организация.АдресОрганизации + " "
	+ Ссылка.Организация.ТелефонОрганизации;
	ЛицеваяСторона.Параметры.Реквизиты                      = Реквизиты;
	ЛицеваяСторона.Параметры.ОКПО 	                        = Ссылка.Организация.ОКПО;
	ЛицеваяСторона.Параметры.Автомобиль                     = Ссылка.Автомобиль;
	ЛицеваяСторона.Параметры.АвтомобильГосНомер             = Ссылка.Автомобиль.ГосНомер;
	ЛицеваяСторона.Параметры.Водитель                       = Ссылка.Водитель.Наименование;
	ЛицеваяСторона.Параметры.НачальныйСпидометр             = ПоказанияНачальногоСпидометра(Ссылка.Автомобиль, Ссылка.Дата);
	//ЛицеваяСторона.Параметры.КонечныйСпидометр              = Ссылка.КонечныйСпидометр;
	ЛицеваяСторона.Параметры.ТопливоВыезд                   = ПоказанияНачальныхОстатков(Ссылка.Автомобиль, Ссылка.Дата);
	//ЛицеваяСторона.Параметры.Горючее                        = Ссылка.Автомобиль.ОсновноеТопливо; 	
	//ЛицеваяСторона.Параметры.ОстатокТопливаВозврат          = Ссылка.ОстатокТопливаВозврат;
	ЛицеваяСторона.Параметры.ВыездИзГаража                  = Ссылка.ВыездИзГаража;
	ЛицеваяСторона.Параметры.ВозвращениеВГараж              = Ссылка.ВозвращениеВГараж;
	ЛицеваяСторона.Параметры.Прицеп                         = Ссылка.Прицеп;
	ЛицеваяСторона.Параметры.ПрицепГосНомер                 = Ссылка.Прицеп.ГосНомер;	
	ЛицеваяСторона.Параметры.МеханикПодпись                 = Ссылка.Механик.Подпись;
	ЛицеваяСторона.Параметры.ДиспетчерПодпись               = Ссылка.Диспетчер.Подпись;      	
	ЛицеваяСторона.Параметры.МедикПодпись                   = Ссылка.Медик.Подпись;
	ЛицеваяСторона.Параметры.ВодительПодпись                = Ссылка.Водитель.Подпись;
	ЛицеваяСторона.Параметры.Организация                    = Ссылка.Организация;	
	ЛицеваяСторона.Параметры.Заказчик                       = Ссылка.Заказчик;
	ЛицеваяСторона.Параметры.ЗаказчикПредставитель          = Ссылка.ЗаказчикПредставитель;
	ЛицеваяСторона.Параметры.ВидРаботы                      = Ссылка.ВидРаботы;
	ЛицеваяСторона.Параметры.Заказчик1                      = Ссылка.Заказчик1;	
	ЛицеваяСторона.Параметры.Заказчик1Представитель         = Ссылка.Заказчик1Представитель; 
	
	//Если ЗначениеЗаполнено(Ссылка.ЗаказчикПредставитель) = Неопределено Тогда
	//	   ЛицеваяСторона.Параметры.ЗаказчикПредставительПодпись		= Ссылка.ЗаказчикПредставитель;

	//Иначе  
	//	  ЛицеваяСторона.Параметры.ЗаказчикПредставительПодпись       = Ссылка.ЗаказчикПредставитель; 
	//	  Если Не ЗначениеЗаполнено(Ссылка.ЗаказчикПредставитель)   Тогда
	//		 ЛицеваяСторона.Параметры.ЗаказчикПредставительПодпись       = Ссылка.ЗаказчикПредставитель; 
	//КонецЕсли;
	//КонецЕсли;
	     	
 
	ЛицеваяСторона.Параметры.ВидРаботы1                     = Ссылка.ВидРаботы1;

	ТабДок.Вывести(ЛицеваяСторона);
КонецПроцедуры

Процедура Печать_СА_Оборотная(ТабДок, Ссылка) Экспорт
	
	ТабДок.ОриентацияСтраницы   = ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб          = Истина;
	ТабДок.ОтображатьСетку      = Ложь;
	ТабДок.ПолеСверху           = 5;
	ТабДок.ПолеСнизу            = 5;
	ТабДок.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ";
	Макет                       = ПолучитьОбщийМакет("СпецАвтомобиль"); 
	ОборотнаяСторона = Макет.ПолучитьОбласть("Оборот");	
	Маршрут = Ссылка.ВидРаботы.АдресПогрузки + " " + Ссылка.ВидРаботы.АдресРазгрузки;
	ОборотнаяСторона.Параметры.Маршрут                       = Маршрут;
    Маршрут1 = Ссылка.ВидРаботы1.АдресПогрузки + " " + Ссылка.ВидРаботы1.АдресРазгрузки;
	ОборотнаяСторона.Параметры.Маршрут1                      = Маршрут1;
	ТабДок.Вывести(ОборотнаяСторона);
	
КонецПроцедуры

Процедура Печать_СА_Печать(ТабДок, Ссылка) Экспорт
	ТабДок.ОриентацияСтраницы   = ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб          = Истина;
	ТабДок.ОтображатьСетку      = Ложь;
	ТабДок.ПолеСверху           = 5;
	ТабДок.ПолеСнизу            = 5;
	ТабДок.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ";
	Макет                       = ПолучитьОбщийМакет("СпецАвтомобиль1");     	
	
	ЛицеваяСторона                                          = Макет.ПолучитьОбласть("Лицо");	
	ЛицеваяСторона.Параметры.Номер                          = Ссылка.Номер;
	ЛицеваяСторона.Параметры.Дата                           = Формат(Ссылка.Дата,"ДЛФ=DD");
	Реквизиты = Ссылка.Организация.Наименование + " " + Ссылка.Организация.АдресОрганизации + " "
	+ Ссылка.Организация.ТелефонОрганизации;
	ЛицеваяСторона.Параметры.Реквизиты                      = Реквизиты;
	ЛицеваяСторона.Параметры.ОКПО 	                        = Ссылка.Организация.ОКПО;
	ЛицеваяСторона.Параметры.Автомобиль                     = Ссылка.Автомобиль;
	ЛицеваяСторона.Параметры.АвтомобильГосНомер             = Ссылка.Автомобиль.ГосНомер;
	ЛицеваяСторона.Параметры.Водитель                       = Ссылка.Водитель.Наименование;
	ЛицеваяСторона.Параметры.НачальныйСпидометр             = ПоказанияНачальногоСпидометра(Ссылка.Автомобиль, Ссылка.Дата);
	ЛицеваяСторона.Параметры.КонечныйСпидометр              = Ссылка.КонечныйСпидометр;
	ЛицеваяСторона.Параметры.ТопливоВыезд                   = ПоказанияНачальныхОстатков(Ссылка.Автомобиль, Ссылка.Дата);
	//ЛицеваяСторона.Параметры.Горючее                        = Ссылка.Автомобиль.ОсновноеТопливо; 	
	ЛицеваяСторона.Параметры.ОстатокТопливаВозврат          = Ссылка.ОстатокТопливаВозврат;
	ЛицеваяСторона.Параметры.ВыездИзГаража                  = Ссылка.ВыездИзГаража;
	ЛицеваяСторона.Параметры.ВозвращениеВГараж              = Ссылка.ВозвращениеВГараж;
	ЛицеваяСторона.Параметры.Прицеп                         = Ссылка.Прицеп;
	ЛицеваяСторона.Параметры.ПрицепГосНомер                 = Ссылка.Прицеп.ГосНомер;	
	ЛицеваяСторона.Параметры.МеханикПодпись                 = Ссылка.Механик.Подпись;
	ЛицеваяСторона.Параметры.ДиспетчерПодпись               = Ссылка.Диспетчер.Подпись;      	
	ЛицеваяСторона.Параметры.МедикПодпись                   = Ссылка.Медик.Подпись;
	ЛицеваяСторона.Параметры.ВодительПодпись                = Ссылка.Водитель.Подпись;
	ЛицеваяСторона.Параметры.Организация                    = Ссылка.Организация;	
	ЛицеваяСторона.Параметры.Заказчик                       = Ссылка.Заказчик;
	ЛицеваяСторона.Параметры.ЗаказчикПредставитель          = Ссылка.ЗаказчикПредставитель;
	
	ЛицеваяСторона.Параметры.Заказчик1                      = Ссылка.Заказчик1;	
	ЛицеваяСторона.Параметры.Заказчик1Представитель         = Ссылка.Заказчик1Представитель; 
	
	//Если Не Ссылка.ЗаказчикВремяПрибытия = Дата(1,1,1) Тогда
	//	ЛицеваяСторона.Параметры.ЗаказчикВремяПрибытия =	"" + Формат(Час(Ссылка.ЗаказчикВремяПрибытия),"ЧЦ=2; ЧН=; ЧВН=") + 
	//	":" + 
	//	Формат(Минута(Ссылка.ЗаказчикВремяПрибытия),"ЧЦ=2; ЧН=; ЧВН="); 	                                                    	
	//КонецЕсли; 
	//
	//Если Не Ссылка.ЗаказчикВремяУбытия = Дата(1,1,1) Тогда
	//	ЛицеваяСторона.Параметры.ЗаказчикВремяУбытия = 		"" + Формат(Час(Ссылка.ЗаказчикВремяУбытия),"ЧЦ=2; ЧН=; ЧВН=") + 
	//	":" + 
	//	Формат(Минута(Ссылка.ЗаказчикВремяУбытия),"ЧЦ=2; ЧН=; ЧВН=");
	//КонецЕсли; 
	//
	  
	//Если Не Ссылка.Заказчик1Представитель = Дата(1,1,1) Тогда
	//	ЛицеваяСторона.Параметры.Заказчик1ВремяПрибытия = 	"" + Формат(Час(Ссылка.Заказчик1ВремяПрибытия),"ЧЦ=2; ЧН=; ЧВН=") + 
	//	":" + 
	//	Формат(Минута(Ссылка.Заказчик1ВремяПрибытия),"ЧЦ=2; ЧН=; ЧВН=");
	//КонецЕсли; 	
	//
	//Если Не Ссылка.Заказчик1ВремяУбытия = Дата(1,1,1) Тогда
	//	ЛицеваяСторона.Параметры.Заказчик1ВремяУбытия = 		"" + Формат(Час(Ссылка.Заказчик1ВремяУбытия),"ЧЦ=2; ЧН=; ЧВН=") + 
	//	":" + 
	//	Формат(Минута(Ссылка.Заказчик1ВремяУбытия),"ЧЦ=2; ЧН=; ЧВН=");
	//КонецЕсли; 													
	
	ТабДок.Вывести(ЛицеваяСторона);

КонецПроцедуры

//////ЛЕГКОВОЙ АВТОМОБИЛЬ//////////////////
Процедура Печать_ЛА_Лицевая(ТабДок, Ссылка) Экспорт
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб 		= Истина;
	ТабДок.ОтображатьСетку 	= Ложь;
	ТабДок.ПолеСверху 		= 5;
	ТабДок.ПолеСнизу 		= 5;
	ТабДок.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ";
	
	Макет = ПолучитьМакет("ЛегковойАвтомобиль");     		
	
	ЛицеваяСторона = Макет.ПолучитьОбласть("Лицо");	
	
	ЛицеваяСторона.Параметры.НомерПутевогоЛиста             = Ссылка.Номер;
	ЛицеваяСторона.Параметры.ДатаПутевогоЛиста              = Формат(Ссылка.Дата,"ДЛФ=DD");	
	ЛицеваяСторона.Параметры.Реквизиты                      = Ссылка.Организация.Наименование + " " + Ссылка.Организация.ПочтовыйАдрес + " " + Ссылка.Организация.Телефоны;
	ЛицеваяСторона.Параметры.ОКПО                           = Ссылка.Организация.КодПоОКПО;
	ЛицеваяСторона.Параметры.Автомобиль                     = Ссылка.Автомобиль;
	ЛицеваяСторона.Параметры.АвтомобильГосНомер             = Ссылка.Автомобиль.ГосНомер;
	ЛицеваяСторона.Параметры.Водитель                       = Ссылка.Водитель.Наименование;
	ЛицеваяСторона.Параметры.ВыездИзГаража                  = Ссылка.ВыездИзГаража;	
	ЛицеваяСторона.Параметры.НачальныйСпидометр             = ПоказанияНачальногоСпидометра(Ссылка.Автомобиль, Ссылка.Дата);
	ЛицеваяСторона.Параметры.ТопливоВыезд                   = ПоказанияНачальныхОстатков(Ссылка.Автомобиль, Ссылка.Дата);
	ЛицеваяСторона.Параметры.ВозвращениеВГараж              = Ссылка.ВозвращениеВГараж;
	//ЛицеваяСторона.Параметры.КонечныйСпидометр              = Ссылка.КонечныйСпидометр;
    //ЛицеваяСторона.Параметры.ОстатокТопливаВозврат          = Ссылка.ОстатокТопливаВозврат;
	ЛицеваяСторона.Параметры.ВРаспоряжениеЛицо              = Ссылка.ЗаказчикПредставитель;
	ЛицеваяСторона.Параметры.ВРаспоряжениеОрганизация       = Ссылка.Заказчик;
	ЛицеваяСторона.Параметры.АдресПодачи                    = Ссылка.Организация.ПочтовыйАдрес;  
	
	ЛицеваяСторона.Параметры.МеханикПодпись                 = Ссылка.Механик;
	ЛицеваяСторона.Параметры.ВодительПодпись                = Ссылка.Водитель;
	ЛицеваяСторона.Параметры.ДиспетчерПодпись               = Ссылка.Диспетчер;      	
	
	//ЛицеваяСторона.Параметры.Горючее                        = Ссылка.Автомобиль.ОсновноеТопливо; 	
	
	ТабДок.Вывести(ЛицеваяСторона);

КонецПроцедуры

Процедура Печать_ЛА_Оборотная(ТабДок, Ссылка) Экспорт		
	ТабДок.ОриентацияСтраницы 	= ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб			= Истина;
	ТабДок.ОтображатьСетку 		= Ложь;
	ТабДок.ПолеСверху			= 5;
	ТабДок.ПолеСнизу			= 5;
	ТабДок.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ";
	
	Макет = ПолучитьМакет("ЛегковойАвтомобиль");     	

	ОборотнаяСторона = Макет.ПолучитьОбласть("Оборот");	
	ТабДок.Вывести(ОборотнаяСторона);    
КонецПроцедуры

//////Автобус Необщего Пользования/////////
Процедура Печать4(ТабДок,Ссылка)  Экспорт
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ПолеСверху = 5;
	ТабДок.ПолеСнизу = 5;
	ТабДок.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Автобуса Необщего Пользования";
	Макет = ПолучитьОбщийМакет("АвтобусНеобщегоПользования");     	
	
	ЛицеваяСторона                                          = Макет.ПолучитьОбласть("Лицо");	
	ЛицеваяСторона.Параметры.НомерПутевогоЛиста             = Ссылка.Номер;
	ЛицеваяСторона.Параметры.ДатаПутевогоЛиста              = Формат(Ссылка.Дата,"ДЛФ=DD");
	Реквизиты = Ссылка.Организация.Наименование + " " + Ссылка.Организация.АдресОрганизации + " "
				+ Ссылка.Организация.ТелефонОрганизации;
	ЛицеваяСторона.Параметры.Реквизиты                      = Реквизиты;
	ЛицеваяСторона.Параметры.ОКПО                           = Ссылка.Организация.ОКПО;
	ЛицеваяСторона.Параметры.МаркаАвтобуса                  = Ссылка.Автомобиль;
	ЛицеваяСторона.Параметры.ГосНомер                       = Ссылка.Автомобиль.ГосНомер;
	
	ЛицеваяСторона.Параметры.Водитель                       = Ссылка.Водитель.Наименование;
 	ЛицеваяСторона.Параметры.Заказчик                       = Ссылка.Заказчик;
	ЛицеваяСторона.Параметры.Заказчик1                      = Ссылка.Заказчик1;
	ЛицеваяСторона.Параметры.Заказчик2                      = Ссылка.Заказчик2;
	ЛицеваяСторона.Параметры.Заказчик3                      = Ссылка.Заказчик3;
	ЛицеваяСторона.Параметры.Заказчик4                      = Ссылка.Заказчик4;
	ЛицеваяСторона.Параметры.ВремяПрибытия                  = Ссылка.ВремяПрибытия;
    ЛицеваяСторона.Параметры.ВремяПрибытия1                 = Ссылка.ВремяПрибытия1;
    ЛицеваяСторона.Параметры.ВремяПрибытия2                 = Ссылка.ВремяПрибытия2;
	ЛицеваяСторона.Параметры.ВремяПрибытия3                 = Ссылка.ВремяПрибытия3;
	ЛицеваяСторона.Параметры.ВремяПрибытия4                 = Ссылка.ВремяПрибытия4;
    ЛицеваяСторона.Параметры.ВыездИзГаража                  = Ссылка.ВыездИзГаража;
    ЛицеваяСторона.Параметры.НачальныйСпидометр             = ПоказанияНачальногоСпидометра(Ссылка.Автомобиль, Ссылка.Дата);
	ЛицеваяСторона.Параметры.ТопливоВыезд                   = ПоказанияНачальныхОстатков(Ссылка.Автомобиль, Ссылка.Дата);	
	//ЛицеваяСторона.Параметры.Горючее                        = Ссылка.Автомобиль.ОсновноеТопливо;
	ЛицеваяСторона.Параметры.ВозвращениеВГараж              = Ссылка.ВозвращениеВГараж;
	//ЛицеваяСторона.Параметры.КонечныйСпидометр              = Ссылка.КонечныйСпидометр;
	//ЛицеваяСторона.Параметры.ОстатокТопливаВозврат          = Ссылка.ОстатокТопливаВозврат;
	
	//ЛицеваяСторона.Параметры.КоличествоЧасов                = Ссылка.КоличествоЧасов;
	//ЛицеваяСторона.Параметры.КоличествоЕздок                = Ссылка.КоличествоЕздок;
	ЛицеваяСторона.Параметры.ДиспетчерПодпись               = Ссылка.Диспетчер.Подпись;
	//ЛицеваяСторона.Параметры.МедикДолжность                 = Ссылка.Медик.Должность;
	ЛицеваяСторона.Параметры.МедикПодпись                   = Ссылка.Медик.Подпись;
	ЛицеваяСторона.Параметры.МеханикПодпись                 = Ссылка.Механик.Подпись;
	ЛицеваяСторона.Параметры.ВодительПодпись                = Ссылка.Водитель.Подпись;
	ЛицеваяСторона.Параметры.ВодительПодпись                = Ссылка.Водитель.Подпись;
	ЛицеваяСторона.Параметры.тлОрганизация                  = Ссылка.Организация.Наименование;
	ЛицеваяСторона.Параметры.тладресТелефон                 = Ссылка.Организация.АдресОрганизации + " " + Ссылка.Организация.ТелефонОрганизации;
    ///////////////////////////////////////
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ПутевойЛистЗаданиеВодителюАвтобусНеОбщегоПользования.Заказчик КАК Заказчик,
	//	|	ПутевойЛистЗаданиеВодителюАвтобусНеОбщегоПользования.ВремяПрибытия КАК ВремяПрибытия
	//	|ИЗ
	//	|	Документ.ПутевойЛист.ЗаданиеВодителюАвтобусНеОбщегоПользования КАК ПутевойЛистЗаданиеВодителюАвтобусНеОбщегоПользования
	//	|ГДЕ
	//	|	ПутевойЛистЗаданиеВодителюАвтобусНеОбщегоПользования.Ссылка = &Ссылка";
	//	
	//Запрос.УстановитьПараметр("Ссылка", Ссылка.Ссылка);

	//Результат = Запрос.Выполнить();
	//
	//ДетальныеЗаписи = Результат.Выбрать();
	//
	//Пока ДетальныеЗаписи.Следующий() Цикл
	//	
	//	ЛицеваяСторона.Параметры.ТчЗаказчик             = ДетальныеЗаписи.Заказчик;
	//	ЛицеваяСторона.Параметры.ТчВремяПрибытия        = Формат(ДетальныеЗаписи.Времяприбытия,"ДЛФ=T");
	//	ЛицеваяСторона.Параметры.ТчЗаказчик1            = ДетальныеЗаписи.Заказчик;
	//	ТабДок.Вывести(ЛицеваяСторона);
	//КонецЦикла;
	//
	//Для счетчик = 1 По 3 - ДетальныеЗаписи.Количество() Цикл
	//
	//	ТабДок.Вывести(ЛицеваяСторона);	
	//
	//КонецЦикла;	
	ТабДок.Вывести(ЛицеваяСторона);
	
КонецПроцедуры

Процедура Печать5(ТабДок,Ссылка)  Экспорт
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ПолеСверху = 5;
	ТабДок.ПолеСнизу = 5;
	ТабДок.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ";
	Макет = ПолучитьОбщийМакет("АвтобусНеобщегоПользования"); 
	ОборотнаяСторона = Макет.ПолучитьОбласть("Оборот");	
	ОборотнаяСторона.Параметры.НомерПутевогоЛиста = Ссылка.Номер;
	ОборотнаяСторона.Параметры.ДатаПутевогоЛиста = Формат(Ссылка.Дата,"ДЛФ=DD");
	ОборотнаяСторона.Параметры.МаркаАвтобуса = Ссылка.Автомобиль;
	ОборотнаяСторона.Параметры.ГосНомер = Ссылка.Автомобиль.ГосНомер;
 	ОборотнаяСторона.Параметры.Заказчик = Ссылка.Заказчик;
	ОборотнаяСторона.Параметры.тлОрганизация = Ссылка.Организация.Наименование;
	ОборотнаяСторона.Параметры.тлАдресТелефон = Ссылка.Организация.АдресОрганизации + " " + Ссылка.Организация.ТелефонОрганизации;
	ТабДок.Вывести(ОборотнаяСторона);
    
КонецПроцедуры //АвтобусНеобщегоПользования

//////ГРУЗОВОЙ АВТОМОБИЛЬ С//////////////////
Процедура Печать_ГА_С_Лицевая(ТабДок, Ссылка) Экспорт
	
	ТабДок.ОриентацияСтраницы 	= ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб 			= Истина;
	ТабДок.ОтображатьСетку 		= Ложь;
	ТабДок.ПолеСверху			= 5;
	ТабДок.ПолеСнизу			= 5;
	
	ТабДок.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ";
	Макет = ПолучитьМакет("ГрузовойАвтомобильС");	
	
	ОбластьШапка 			= Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьЗадание 			= Макет.ПолучитьОбласть("ОбластьЗадание");
	ОбластьЗаданиеПустая 	= Макет.ПолучитьОбласть("ОбластьЗаданиеПустая");
	ОбластьПодвал 			= Макет.ПолучитьОбласть("ОбластьПодвал");
	
	ОбластьШапка.Параметры.НомерПутевогоЛиста			= Ссылка.Номер;
	ОбластьШапка.Параметры.Дата 						= Формат(Ссылка.Дата,"ДЛФ=DD");
	ОбластьШапка.Параметры.ТопливоВыезд       			= ПоказанияНачальныхОстатков(Ссылка.Автомобиль, Ссылка.Дата);
	ОбластьШапка.Параметры.НачальныйСпидометр		 	= ПоказанияНачальногоСпидометра(Ссылка.Автомобиль,Ссылка.Дата);
	//ОбластьШапка.Параметры.Горючее  		          	= Ссылка.Автомобиль.ОсновноеТопливо;	
	ОбластьШапка.Параметры.ОКПО		               		= Ссылка.Организация.КодПоОКПО;
	ОбластьШапка.Параметры.НаименованиеОрганизации 		= Строка(Ссылка.Организация)+" 129515, г.Москва, ул Академика Королева, д.9, корп. 5, тел. 8(495)225-56-00"; 
	ОбластьШапка.Параметры.Автомобиль         			= Ссылка.Автомобиль;
	ОбластьШапка.Параметры.АвтомобильГосНомер 			= Ссылка.Автомобиль.ГосНомер;
	ОбластьШапка.Параметры.Водитель		        		= Ссылка.Водитель;
	ОбластьШапка.Параметры.Прицеп       		   		= Ссылка.Прицеп;
	ОбластьШапка.Параметры.ПрицепГосНомер     			= Ссылка.Прицеп.ГосНомер;
	ОбластьШапка.Параметры.Прицеп1            			= Ссылка.Прицеп1;
	ОбластьШапка.Параметры.Прицеп1ГосНомер    			= Ссылка.Прицеп1.ГосНомер;
    ОбластьШапка.Параметры.НачальныйСпидометр 			= ПоказанияНачальногоСпидометра(Ссылка.Автомобиль, Ссылка.Дата);
	ОбластьШапка.Параметры.ТопливоВыезд       			= ПоказанияНачальныхОстатков(Ссылка.Автомобиль, Ссылка.Дата);	
	//кухарь 12.04.15 начало
	ОбластьШапка.Параметры.ВодительНомерУдостоверения	= Ссылка.Водитель.НомерВУ;
	//кухарь 12.04.15 конец	
	
	Если НЕ Ссылка.ВыездИзГаража          = Дата(1,1,1) Тогда		
		ОбластьШапка.Параметры.ВыездЧисло = Формат(День(Ссылка.Дата),"ЧЦ=2; ЧН=; ЧВН=");
		ОбластьШапка.Параметры.ВыездМесяц = Формат(Месяц(Ссылка.Дата),"ЧЦ=2; ЧН=; ЧВН=");
		ОбластьШапка.Параметры.ВыездЧас   = Формат(Час(Ссылка.ВыездИзГаража),"ЧЦ=2; ЧН=; ЧВН=");
		ОбластьШапка.Параметры.ВыездМин   = Формат(Минута(Ссылка.ВыездИзГаража),"ЧЦ=2; ЧН=; ЧВН=");
	КонецЕсли; 

	Если Не Ссылка.ВозвращениеВГараж            = Дата(1,1,1) Тогда	
		ОбластьШапка.Параметры.ВозвращениеЧисло = Формат(День(Ссылка.Дата),"ЧЦ=2; ЧН=; ЧВН=");
		ОбластьШапка.Параметры.ВозвращениеМесяц = Формат(Месяц(Ссылка.Дата),"ЧЦ=2; ЧН=; ЧВН=");
		ОбластьШапка.Параметры.ВозвращениеЧас   = Формат(Час(Ссылка.ВозвращениеВГараж),"ЧЦ=2; ЧН=; ЧВН=");
		ОбластьШапка.Параметры.ВозвращениеМин   = Формат(Минута(Ссылка.ВозвращениеВГараж),"ЧЦ=2; ЧН=; ЧВН=");
	КонецЕсли;
	
	ТабДок.Вывести(ОбластьШапка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПутевойЛистЗаданиеВодителю.Заказчик,
		|	ПутевойЛистЗаданиеВодителю.ВремяПрибытия,
		|	ПутевойЛистЗаданиеВодителю.АдресПунктаПогрузки,
		|	ПутевойЛистЗаданиеВодителю.АдресПунктаРазгрузки,
		|	ПутевойЛистЗаданиеВодителю.Груз,
		|	ПутевойЛистЗаданиеВодителю.КоличествоЕздок,
		|	ПутевойЛистЗаданиеВодителю.Расстояние,
		|	ПутевойЛистЗаданиеВодителю.ПеревезтиТонн
		|ИЗ
		|	Документ.ПутевойЛист.ЗаданиеВодителю КАК ПутевойЛистЗаданиеВодителю
		|ГДЕ
		|	ПутевойЛистЗаданиеВодителю.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Ссылка.Ссылка);

	Результат = Запрос.Выполнить();
	
	ДетальныеЗаписи = Результат.Выбрать();
	
	Пока ДетальныеЗаписи.Следующий() Цикл
		//Кухарь 12.04.15 начало
		//ОбластьЗадание.Параметры.ТчЗаказчик             = ДетальныеЗаписи.Заказчик;
		ОбластьЗадание.Параметры.ТчЗаказчик             = "ООО ""ЕЕЭ""";
		//Кухарь 12.04.15 конец

		ОбластьЗадание.Параметры.ТчВремяПрибытия        = Формат(ДетальныеЗаписи.Времяприбытия,"ДЛФ=T");
		ОбластьЗадание.Параметры.ТчАдресПунктаПогрузки  = ДетальныеЗаписи.АдресПунктаПогрузки;
		ОбластьЗадание.Параметры.ТчАдресПунктаРазгрузки = ДетальныеЗаписи.АдресПунктаРазгрузки;
		//Кухарь 12.04.15 начало
		//ОбластьЗадание.Параметры.ТчНаименованиеГруза    = ДетальныеЗаписи.Груз;
		ОбластьЗадание.Параметры.ТчНаименованиеГруза    = "Трикотаж. изд. бельё.";
		//Кухарь 12.04.15 конец
		ОбластьЗадание.Параметры.ТчКоличествоЕздок      = ДетальныеЗаписи.КоличествоЕздок;
		ОбластьЗадание.Параметры.ТчРасстояние           = ДетальныеЗаписи.Расстояние;				
		ОбластьЗадание.Параметры.ТчПеревезтиТонн        = ДетальныеЗаписи.ПеревезтиТонн;
		ТабДок.Вывести(ОбластьЗадание);
	КонецЦикла;
	
	//Кухарь 12.04.15 начало
	//Для счетчик = 1 По 3 - ДетальныеЗаписи.Количество() Цикл
	Для счетчик = 1 По 7 - ДетальныеЗаписи.Количество() Цикл
	//Кухарь 12.04.15 конец

		ТабДок.Вывести(ОбластьЗаданиеПустая);	
	
	КонецЦикла; 
	//Кухарь 12.04.15 начало  	
	//ОбластьПодвал.Параметры.ДиспетчерПодпись                = Ссылка.Диспетчер.Подпись;
	//ОбластьПодвал.Параметры.МедикПодпись                    = Ссылка.Медик.Подпись;
	//ОбластьПодвал.Параметры.МеханикВыездРазрешилПодпись     = Ссылка.Механик.Подпись;
	//ОбластьПодвал.Параметры.ВодительАвтомобильПринялПодпись = Ссылка.Водитель.Подпись;
	//ОбластьПодвал.Параметры.ВодительАвтомобильСдалПодпись   = Ссылка.Водитель.Подпись;
	ОбластьПодвал.Параметры.ДиспетчерПодпись                = Ссылка.Диспетчер;
	ОбластьПодвал.Параметры.МедикПодпись                    = Ссылка.Медик;
	ОбластьПодвал.Параметры.МеханикВыездРазрешилПодпись     = Ссылка.Механик;
	ОбластьПодвал.Параметры.ВодительАвтомобильПринялПодпись = Ссылка.Водитель;
	ОбластьПодвал.Параметры.ВодительАвтомобильСдалПодпись   = Ссылка.Водитель;
	//Кухарь 12.04.15 конец

	ТабДок.Вывести(ОбластьПодвал);

КонецПроцедуры

Процедура Печать_ГА_С_Оборотная(ТабДок, Ссылка) Экспорт
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ПолеСверху = 5;
	ТабДок.ПолеСнизу = 5;
	ТабДок.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ";
	
	Макет = ПолучитьМакет("ГрузовойАвтомобильС");	
	ОбластьОборот = Макет.ПолучитьОбласть("Оборот");
	ТабДок.Вывести(ОбластьОборот);

КонецПроцедуры

//////ГРУЗОВОЙ АВТОМОБИЛЬ П//////////////////
Процедура Печать_ГА_П_Лицевая(ТабДок, Ссылка) Экспорт
	
	ТабДок.ОриентацияСтраницы   = ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб          = Истина;
	ТабДок.ОтображатьСетку      = Ложь;
	ТабДок.ПолеСверху           = 5;
	ТабДок.ПолеСнизу            = 5;
	ТабДок.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ";
	
	Макет                       = ПолучитьМакет("ГрузовойАвтомобиль");     	
	
	ЛицеваяСторона                                          = Макет.ПолучитьОбласть("Лицо");	
	ЛицеваяСторона.Параметры.Номер                          = Ссылка.Номер;
	ЛицеваяСторона.Параметры.Дата                           = Формат(Ссылка.Дата,"ДЛФ=DD");
	ЛицеваяСторона.Параметры.Реквизиты                      = Ссылка.Организация.Наименование + " " + Ссылка.Организация.ПочтовыйАдрес + " " + Ссылка.Организация.Телефоны;	
	ЛицеваяСторона.Параметры.ОКПО 	                        = Ссылка.Организация.КодПоОКПО;
	ЛицеваяСторона.Параметры.Автомобиль                     = Ссылка.Автомобиль;
	ЛицеваяСторона.Параметры.АвтомобильГосНомер             = Ссылка.Автомобиль.ГосНомер;
	ЛицеваяСторона.Параметры.Водитель                       = Ссылка.Водитель.Наименование;
	ЛицеваяСторона.Параметры.НачальныйСпидометр             = ПоказанияНачальногоСпидометра(Ссылка.Автомобиль, Ссылка.Дата);
	ЛицеваяСторона.Параметры.Заказчик                       = Ссылка.Заказчик;
	ЛицеваяСторона.Параметры.Заказчик1                      = Ссылка.Заказчик1;
	//ЛицеваяСторона.Параметры.КонечныйСпидометр              = Ссылка.КонечныйСпидометр;
	ЛицеваяСторона.Параметры.ТопливоВыезд                   = ПоказанияНачальныхОстатков(Ссылка.Автомобиль, Ссылка.Дата);
	//ЛицеваяСторона.Параметры.Горючее                        = Ссылка.Автомобиль.ОсновноеТопливо; 	
	//ЛицеваяСторона.Параметры.ОстатокТопливаВозврат          = Ссылка.ОстатокТопливаВозврат;
	ЛицеваяСторона.Параметры.Прицеп                         = Ссылка.Прицеп;
	ЛицеваяСторона.Параметры.ПрицепГосНомер                 = Ссылка.Прицеп.ГосНомер;	
	ЛицеваяСторона.Параметры.Прицеп1                        = Ссылка.Прицеп1;
	ЛицеваяСторона.Параметры.Прицеп1Госномер                = Ссылка.Прицеп1.ГосНомер;
	ЛицеваяСторона.Параметры.МеханикПодпись                 = Ссылка.Механик;
	ЛицеваяСторона.Параметры.ДиспетчерПодпись               = Ссылка.Диспетчер;      	
	ЛицеваяСторона.Параметры.МедикПодпись                   = Ссылка.Медик;
	ЛицеваяСторона.Параметры.ВодительПодпись                = Ссылка.Водитель;
	
	Если НЕ Ссылка.ВыездИзГаража = Дата(1,1,1) Тогда		
		ЛицеваяСторона.Параметры.ВыездЧисло = Формат(День(Ссылка.Дата),"ЧЦ=2; ЧН=; ЧВН=");
		ЛицеваяСторона.Параметры.ВыездМесяц = Формат(Месяц(Ссылка.Дата),"ЧЦ=2; ЧН=; ЧВН=");
		ЛицеваяСторона.Параметры.ВыездЧас = Формат(Час(Ссылка.ВыездИзГаража),"ЧЦ=2; ЧН=; ЧВН=");
		ЛицеваяСторона.Параметры.ВыездМин = Формат(Минута(Ссылка.ВыездИзГаража),"ЧЦ=2; ЧН=; ЧВН=");
	КонецЕсли; 

	Если Не Ссылка.ВозвращениеВГараж = Дата(1,1,1) Тогда	
		ЛицеваяСторона.Параметры.ВозвращениеЧисло = Формат(День(Ссылка.Дата),"ЧЦ=2; ЧН=; ЧВН=");
		ЛицеваяСторона.Параметры.ВозвращениеМесяц = Формат(Месяц(Ссылка.Дата),"ЧЦ=2; ЧН=; ЧВН=");
		ЛицеваяСторона.Параметры.ВозвращениеЧас   = Формат(Час(Ссылка.ВозвращениеВГараж),"ЧЦ=2; ЧН=; ЧВН=");
		ЛицеваяСторона.Параметры.ВозвращениеМин   = Формат(Минута(Ссылка.ВозвращениеВГараж),"ЧЦ=2; ЧН=; ЧВН=");
	КонецЕсли;
	
	ТабДок.Вывести(ЛицеваяСторона);

КонецПроцедуры

Процедура Печать_ГА_П_Оборотная(ТабДок, Ссылка) Экспорт	
	ТабДок.ОриентацияСтраницы   = ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб          = Истина;
	ТабДок.ОтображатьСетку      = Ложь;
	ТабДок.ПолеСверху           = 5;
	ТабДок.ПолеСнизу            = 5;
	ТабДок.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ";
	
	Макет                       = ПолучитьМакет("ГрузовойАвтомобиль");	
	
	ОбластьОборот = Макет.ПолучитьОбласть("Оборот");
	
	ОбластьОборот.Параметры.Заказчик            = Ссылка.Заказчик;
	ОбластьОборот.Параметры.Заказчик1           = Ссылка.Заказчик1;
	ОбластьОборот.Параметры.Организация         = Ссылка.Организация;
	ОбластьОборот.Параметры.Автомобиль          = Ссылка.Автомобиль;
	ОбластьОборот.Параметры.АвтомобильГосНомер  = Ссылка.Автомобиль.ГосНомер;
	ОбластьОборот.Параметры.Прицеп              = Ссылка.Прицеп;
	ОбластьОборот.Параметры.ПрицепГосНомер      = Ссылка.Прицеп.ГосНомер;
	
	ТабДок.Вывести(ОбластьОборот);
КонецПроцедуры


Процедура ПечатьЛицевая(ТабДок, Ссылка) Экспорт	
	ТипПутевого=Ссылка.ТипПутевого;
	Если ТипПутевого=Перечисления.ТипПутевогоЛиста.ГрузовойАвтомобильФорма4_С Тогда
		Печать_ГА_С_Лицевая(ТабДок, Ссылка);					
	ИначеЕсли ТипПутевого=Перечисления.ТипПутевогоЛиста.ГрузовойАвтомобильФорма4_П Тогда
		Печать_ГА_П_Лицевая(ТабДок, Ссылка);		
	КонецЕсли;
КонецПроцедуры

Процедура ПечатьОборотная(ТабДок, Ссылка) Экспорт	
	ТипПутевого=Ссылка.ТипПутевого;
	Если ТипПутевого=Перечисления.ТипПутевогоЛиста.ГрузовойАвтомобильФорма4_С Тогда
		Печать_ГА_С_Оборотная(ТабДок, Ссылка);
	ИначеЕсли ТипПутевого=Перечисления.ТипПутевогоЛиста.ГрузовойАвтомобильФорма4_П Тогда
		Печать_ГА_П_Оборотная(ТабДок, Ссылка);		
	КонецЕсли;
КонецПроцедуры
  

Функция ПоказанияНачальногоСпидометра(Автомобиль,Дата) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|    МАКСИМУМ(КонечныйСпидометр)
	|ИЗ
	|    Документ.ПутевойЛист
	|ГДЕ
	|	Автомобиль=&Автомобиль
	|	И Дата<&Дата
	|";
	
	Запрос.УстановитьПараметр("Дата",		НачалоДня(Дата));
	Запрос.УстановитьПараметр("Автомобиль",	Автомобиль);
	
	Результат	= 0;
	Выборка		= Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат=Выборка.КонечныйСпидометр;			
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции	

Функция ПоказанияНачальныхОстатков(Автомобиль,Дата) Экспорт	  
	Возврат РегистрыНакопления.ОстаткиГСМ.Остатки(Дата,Новый Структура("Автомобиль",Автомобиль),,"Количество").Итог("Количество");	  	 
КонецФункции

#Область ЧтиениеРегисраСведений

&НаСервере 
Функция ПрочитатьЗначениеГосНомера(_Авто,_Дт) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =" 
	|ВЫБРАТЬ
	|	ГосНомер
	|ИЗ
	|	Справочник.Автомобили
	|ГДЕ	
	|	Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", _Авто);
	Выборка		= Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ГосНомер;		
	КонецЦикла;
КонецФункции	
 	
&НаСервере
Процедура ЗаписатьЗначениеГосНомера(Авто, Дт,ЗначениеГосНомера) Экспорт 
	
	МенеджерЗаписи = РегистрыСведений.РегистрационныйНомер.СоздатьМенеджерЗаписи();
	//кухарь 12.04.15 начало
	//МенеджерЗаписи.Период = Дт;
	МенеджерЗаписи.Период = ТекущаяДата();
	//кухарь 12.04.15 конец

	МенеджерЗаписи.Автомобиль = Авто;
	МенеджерЗаписи.ГосНомер = ЗначениеГосНомера;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

&НаСервере
Функция ПрочитатьНормуРасходаНа100км(Авто,Период) Экспорт	
	Результат	= 0;
	
	Нормы		= РегистрыСведений.НормыРасходаГСМ.СрезПоследних(КонецДня(Период),Новый Структура("МодельТС",Авто));
	Если Нормы.Количество()>0 Тогда
		Результат	= Нормы[0].Линейная;	
	КонецЕсли; 

	Возврат Результат;	
КонецФункции

&НаСервере
Функция ПрочитатьНормуНаОперацию(МодельТС,Период) Экспорт
	Данные=РегистрыСведений.НормыРасходаГСМ.СрезПоследних(КонецДня(Период),Новый Структура("МодельТС",МодельТС));
	Если Данные.Количество()>0 Тогда
		Результат=Данные[0].НормаНаОперацию;			
	Иначе
		Результат=0;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция ПрочитатьРежимРаботыВодителей(Сотрудник, Автомобиль, Дт) Экспорт
	Возврат Неопределено;
КонецФункции

&НаСервере
Функция ПрочитатьРежимРаботыВодителей1(Сотрудник, Автомобиль, Дт) Экспорт
	Возврат Неопределено;
КонецФункции

#КонецОбласти

&НаСервере
Функция ПроверкаПроведенныхДокументов(Автомобиль,Период)Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст ="
	|ВЫБРАТЬ
	|  Ссылка
	|ИЗ
	|  Документ.ПутевойЛист
	|ГДЕ
	|  Проведен
	|  И Дата > &Дата
	|  И Автомобиль = &Ссылка
	|";
	
	Запрос.УстановитьПараметр("Дата", 		Период);
	Запрос.УстановитьПараметр("Ссылка", 	Автомобиль);
	
	Результат = Запрос.Выполнить();	
	Если НЕ Результат.Пустой() Тогда 		
		Выборка= Результат.Выбрать();
		Пока Выборка.Следующий()Цикл
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = Строка("Отменено проведение: "+Выборка.Ссылка);
			Сообщение.Сообщить();
			
			ОбъектПутевойЛист = Выборка.Ссылка.ПолучитьОбъект();			
			ОбъектПутевойЛист.Проведен = Ложь;
			ОбъектПутевойЛист.Записать();
		КонецЦикла;		
	КонецЕсли;
	
КонецФункции
